espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/silabs/wiseconnect-wifi-bt-sdk/examples/snippets/wlan_bt_ble/wlan_https_bt_a2dp/platforms/nxp/rt595/devices/MIMXRT595S/drivers/fsl_powerquad_cmsis.c
        case 16U:
            S->pTwiddle   = (q15_t *)dct16_twiddle;
            S->pCosFactor = (q15_t *)dct16_cosFactor;
            break;

        default:
            return ARM_MATH_ARGUMENT_ERROR;
    }

    /* Initialize the RFFT/RIFFT Function */
    arm_rfft_init_q15(S->pRfft, S->N, 0, 1);

    /* return the status of DCT4 Init function */
    return ARM_MATH_SUCCESS;
}

void arm_dct4_q15(const arm_dct4_instance_q15 *S, q15_t *pState, q15_t *pInlineBuffer)
{
    /* Calculate DCT-II for N-point input */
    uint16_t i;           /* Loop counter */
    const q15_t *weights; /* Pointer to the Weights table */
    q15_t *pOut;          /* Temporary pointers for output buffer */
    q15_t *pS1, *pbuff;   /* Temporary pointers for input buffer and pState buffer */
    q15_t in;             /* Temporary variable */
    const q15_t *cosFact;
    uint32_t length;
    uint8_t matRow;
    uint8_t matCol;
    uint8_t matLoop;
    uint16_t lenPerMatLoop;

    /*
     * Pre-processing involves multiplying input with cos factor,
     *     r(n) = 2 * u(n) * cos(pi*(2*n+1)/(4*N))
     *              where,
     *                 r(n) -- output of preprocessing
     *                 u(n) -- input to preprocessing(actual Source buffer)
     */

    /*
     * Use matrix production function for preprocessing. Matrix production
     * supports 16x16 at the most, so the matrix row is set to 16.
     */
    matRow        = 16;
    lenPerMatLoop = S->N >= 256 ? 256 : S->N;
    matCol        = lenPerMatLoop / 16;
    matLoop       = ((S->N - 1) >> 8) + 1;
    cosFact       = S->pCosFactor;
    pbuff         = pInlineBuffer;

    length = POWERQUAD_MAKE_MATRIX_LEN(matRow, matCol, 0);

    while (matLoop--)
    {
        PQ_SET_MAT_FIX32_WORKAROUND_SCALE_CONFIG;

        /* cos factor is Q31, convert to float */
        PQ_MatrixScale(POWERQUAD, length, 2.0f / 2147483648.0f, cosFact, (void *)0xE0000000);
        cosFact += 2 * lenPerMatLoop;

        PQ_WaitDone(POWERQUAD);

        /* Product. */
        POWERQUAD->OUTFORMAT = ((uint32_t)(0) << 8U) | ((uint32_t)kPQ_16Bit << 4U) | kPQ_Float;
        POWERQUAD->INAFORMAT = ((uint32_t)(0) << 8U) | ((uint32_t)kPQ_16Bit << 4U) | kPQ_Float;
        POWERQUAD->INBFORMAT = ((uint32_t)(0) << 8U) | ((uint32_t)kPQ_Float << 4U) | kPQ_Float;
        POWERQUAD->TMPFORMAT = ((uint32_t)(0) << 8U) | ((uint32_t)kPQ_Float << 4U) | kPQ_Float;
        POWERQUAD->TMPBASE   = 0xE0000000;

        PQ_MatrixProduct(POWERQUAD, length, pbuff, (void *)0xE0000000, pbuff);

        PQ_WaitDone(POWERQUAD);

        pbuff += lenPerMatLoop;
    }

    PQ_SET_FFT_Q15_CONFIG;

    PQ_TransformRDCT(POWERQUAD, S->N, pInlineBuffer, pState);

    /* ARM calculation while PQ is running. */
    /*
     * Use matrix production function for twiddle multiplication.
     * Matrix production supports 16x16 at the most. The total elements are 2*N;
     */
    lenPerMatLoop = S->N >= 128 ? 128 : S->N;
    matCol        = lenPerMatLoop / 8;
    matLoop       = ((S->N - 1) >> 7) + 1;
    weights       = S->pTwiddle;
    pOut          = pState;

    length = POWERQUAD_MAKE_MATRIX_LEN(matRow, matCol, matCol);

    PQ_WaitDone(POWERQUAD);

    while (matLoop--)
    {
        PQ_SET_MAT_FIX32_WORKAROUND_SCALE_CONFIG;

        /* Downscale by 1024 * 1024 * 16, because the twiddle are multiplied by 1024 * 1024 * 16. */
        PQ_MatrixScale(POWERQUAD, length, 1.0f / 16777216.0f, weights, (void *)0xE0000000);
        weights += lenPerMatLoop * 2;

        PQ_WaitDone(POWERQUAD);

        /* Product. */
        POWERQUAD->OUTFORMAT = ((uint32_t)(0) << 8U) | ((uint32_t)kPQ_16Bit << 4U) | kPQ_Float;
        POWERQUAD->INAFORMAT = ((uint32_t)(0) << 8U) | ((uint32_t)kPQ_16Bit << 4U) | kPQ_Float;
        POWERQUAD->INBFORMAT = ((uint32_t)(0) << 8U) | ((uint32_t)kPQ_Float << 4U) | kPQ_Float;
        POWERQUAD->TMPFORMAT = ((uint32_t)(0) << 8U) | ((uint32_t)kPQ_Float << 4U) | kPQ_Float;
        POWERQUAD->TMPBASE   = 0xE0000000;

        PQ_MatrixProduct(POWERQUAD, length, pOut, (void *)0xE0000000, pOut);

        PQ_WaitDone(POWERQUAD);

        for (i = 0; i < lenPerMatLoop / 4; i++)
        {
            *pOut -= *(pOut + 1);
            pOut += 2;
            *pOut -= *(pOut + 1);
            pOut += 2;
            *pOut -= *(pOut + 1);
            pOut += 2;
            *pOut -= *(pOut + 1);
            pOut += 2;
        }
    }

    /* ----------- Post-processing ---------- */
    /* DCT-IV can be obtained from DCT-II by the equation,
     *       Y4(k) = Y2(k) - Y4(k-1) and Y4(-1) = Y4(0)
     *       Hence, Y4(0) = Y2(0)/2  */
    /* Getting only real part from the output and Converting to DCT-IV */

    /* pbuff initialized to input buffer. */
    pbuff = pInlineBuffer;

    /* pS1 initialized to pState */
    pS1 = pState;

    /* Calculating Y4(0) from Y2(0) using Y4(0) = Y2(0)/2. Considering the DCT II normalize, here divided by sqrt(2).*/
    in       = (q15_t)((float)*pS1 / 1.41421356237f);
    *pbuff++ = in;
    pS1 += 2;

    in       = *pS1 - in;
    *pbuff++ = in;
    pS1 += 2;

    in       = *pS1 - in;
    *pbuff++ = in;
    pS1 += 2;

    in       = *pS1 - in;
    *pbuff++ = in;
    pS1 += 2;

    i = S->N / 4 - 1;

    while (i > 0U)
    {
        in       = *pS1 - in;
        *pbuff++ = in;
        pS1 += 2;

        in       = *pS1 - in;
        *pbuff++ = in;
        pS1 += 2;

        in       = *pS1 - in;
        *pbuff++ = in;
        pS1 += 2;

        in       = *pS1 - in;
        *pbuff++ = in;
        pS1 += 2;

        i--;
    }
}

void arm_fir_init_f32(
    arm_fir_instance_f32 *S, uint16_t numTaps, const float32_t *pCoeffs, float32_t *pState, uint32_t blockSize)
{
    uint32_t i;

    /*
     * CMSIS DSP API filter coefficients stored in time reversed order, but PQ
     * uses the positive order. PQ does not use pState, so pState pState[1:numTaps]
     * is used here to save the coefficients in positive order. At the same time,
     * pState[0] is used to save the offset used for incremetal calculation.
     * Because the length of pState is (numTaps + blockSize -1), to ensure enough space,
     * the blockSize should be larger than 1.
     */
    assert(blockSize > 1);

