espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/silabs/wiseconnect-wifi-bt-sdk/examples/snippets/wlan_bt_ble/wlan_https_bt_a2dp/platforms/nxp/rt595/devices/MIMXRT595S/drivers/fsl_powerquad_cmsis.c
    arm_status status;
    q31_t length;

#ifdef ARM_MATH_MATRIX_CHECK
    /* Check for matrix mismatch condition */
    if ((pSrc->numRows != pSrc->numCols) || (pDst->numRows != pDst->numCols) || (pSrc->numRows != pDst->numRows))
    {
        /* Set status as ARM_MATH_SIZE_MISMATCH */
        status = ARM_MATH_SIZE_MISMATCH;
    }
    else
#endif
    {
        PQ_SET_FIX32_CONFIG;

        length = (pSrc->numCols << 8) | (pSrc->numRows << 0);

        PQ_MatrixTranspose(POWERQUAD, length, pSrc->pData, pDst->pData);

        /* Wait for the completion */
        PQ_WaitDone(POWERQUAD);

        status = ARM_MATH_SUCCESS;
    }

    /* Return to application */
    return status;
}

arm_status arm_mat_trans_q15(const arm_matrix_instance_q15 *pSrc, arm_matrix_instance_q15 *pDst)
{
    assert(pSrc);
    assert(pDst);

    arm_status status;
    q31_t length;

#ifdef ARM_MATH_MATRIX_CHECK
    /* Check for matrix mismatch condition */
    if ((pSrc->numRows != pSrc->numCols) || (pDst->numRows != pDst->numCols) || (pSrc->numRows != pDst->numRows))
    {
        /* Set status as ARM_MATH_SIZE_MISMATCH */
        status = ARM_MATH_SIZE_MISMATCH;
    }
    else
#endif
    {
        PQ_SET_FIX16_CONFIG;

        length = (pSrc->numCols << 8) | (pSrc->numRows << 0);

        PQ_MatrixTranspose(POWERQUAD, length, pSrc->pData, pDst->pData);

        /* Wait for the completion */
        PQ_WaitDone(POWERQUAD);

        status = ARM_MATH_SUCCESS;
    }

    /* Return to application */
    return status;
}

arm_status arm_mat_scale_f32(const arm_matrix_instance_f32 *pSrc, float32_t scale, arm_matrix_instance_f32 *pDst)
{
    assert(pSrc);
    assert(pDst);

    arm_status status;
    q31_t length;

#ifdef ARM_MATH_MATRIX_CHECK
    /* Check for matrix mismatch condition */
    if ((pSrc->numRows != pSrc->numCols) || (pDst->numRows != pDst->numCols) || (pSrc->numRows != pDst->numRows))
    {
        /* Set status as ARM_MATH_SIZE_MISMATCH */
        status = ARM_MATH_SIZE_MISMATCH;
    }
    else
#endif
    {
        PQ_SET_F32_CONFIG;

        length = (pSrc->numCols << 8) | (pSrc->numRows << 0);

        PQ_MatrixScale(POWERQUAD, length, scale, pSrc->pData, pDst->pData);

        /* Wait for the completion */
        PQ_WaitDone(POWERQUAD);

        status = ARM_MATH_SUCCESS;
    }

    /* Return to application */
    return status;
}

arm_status arm_mat_scale_q31(const arm_matrix_instance_q31 *pSrc,
                             q31_t scale,
                             int32_t shift,
                             arm_matrix_instance_q31 *pDst)
{
    assert(pSrc);
    assert(pDst);

    arm_status status;
    q31_t length;
    float scaleFloat;

    pq_config_t config = {
        kPQ_32Bit,              /* inputAFormat   */
        0,                      /* inputAPrescale */
        kPQ_32Bit,              /* inputBFormat   */
        0,                      /* inputBPrescale */
        kPQ_32Bit,              /* outputFormat   */
        (int8_t)shift,          /* outputPrescale */
        kPQ_Float,              /* tmpFormat      */
        0,                      /* tmpPrescale    */
        kPQ_Float,              /* machineFormat  */
        (uint32_t *)0xe0000000, /* tmpBase        */
    };

#ifdef ARM_MATH_MATRIX_CHECK
    /* Check for matrix mismatch condition */
    if ((pSrc->numRows != pSrc->numCols) || (pDst->numRows != pDst->numCols) || (pSrc->numRows != pDst->numRows))
    {
        /* Set status as ARM_MATH_SIZE_MISMATCH */
        status = ARM_MATH_SIZE_MISMATCH;
    }
    else
#endif
    {
        length = (pSrc->numCols << 8) | (pSrc->numRows << 0);

        scaleFloat = PQ_Q31_2_FLOAT(scale);

        PQ_SetConfig(POWERQUAD, &config);

        PQ_MatrixScale(POWERQUAD, length, scaleFloat, pSrc->pData, pDst->pData);

        /* Wait for the completion */
        PQ_WaitDone(POWERQUAD);

        status = ARM_MATH_SUCCESS;
    }

    /* Return to application */
    return status;
}

arm_status arm_mat_scale_q15(const arm_matrix_instance_q15 *pSrc,
                             q15_t scale,
                             int32_t shift,
                             arm_matrix_instance_q15 *pDst)
{
    assert(pSrc);
    assert(pDst);

    arm_status status;
    q31_t length;
    float scaleFloat;

    pq_config_t config = {
        kPQ_16Bit,              /* inputAFormat   */
        0,                      /* inputAPrescale */
        kPQ_16Bit,              /* inputBFormat   */
        0,                      /* inputBPrescale */
        kPQ_16Bit,              /* outputFormat   */
        (int8_t)shift,          /* outputPrescale */
        kPQ_Float,              /* tmpFormat      */
        0,                      /* tmpPrescale    */
        kPQ_Float,              /* machineFormat  */
        (uint32_t *)0xe0000000, /* tmpBase        */
    };

#ifdef ARM_MATH_MATRIX_CHECK
    /* Check for matrix mismatch condition */
    if ((pSrc->numRows != pSrc->numCols) || (pDst->numRows != pDst->numCols) || (pSrc->numRows != pDst->numRows))
    {
        /* Set status as ARM_MATH_SIZE_MISMATCH */
        status = ARM_MATH_SIZE_MISMATCH;
    }
    else
#endif
    {
        length = (pSrc->numCols << 8) | (pSrc->numRows << 0);

        scaleFloat = PQ_Q15_2_FLOAT(scale);

        PQ_SetConfig(POWERQUAD, &config);

        PQ_MatrixScale(POWERQUAD, length, scaleFloat, pSrc->pData, pDst->pData);

        /* Wait for the completion */
        PQ_WaitDone(POWERQUAD);

        status = ARM_MATH_SUCCESS;
    }

    /* Return to application */
    return status;
}
